Revit 2027 API
StructuralSection.ElasticModulusWeakAxis Property
 Elastic section modulus about main weak axis for calculation of bending stresses.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ElasticModulusWeakAxis { get; set; }
Public Property ElasticModulusWeakAxis As Double
	Get
	Set
public:
property double ElasticModulusWeakAxis {
	double get ();
	void set (double value);
}
member ElasticModulusWeakAxis : float with get, set
Property Value
Double
See Also
Reference
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace